snlkuharlocal/src/DataProcessors/ОтчетыДляРегиональныхПредставителей/ОтчетыДляРегиональныхПредставителей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОтчетыДляРегиональныхПредставителей</name>
  <attributes>
    <name>ПостроительОтчета</name>
    <type>
      <types>ReportBuilder</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

snlkuharlocal/src/AccumulationRegisters/Взаиморасчеты/Взаиморасчеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Взаиморасчеты</name>
  <resources>
    <name>СуммаВал</name>
    <comment>Сумма в рублях</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаУпр</name>
    <comment>Сумма в валюте расчетов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата_НачалаЗадолженности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Документ_ЗакрытогоПериода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УИД_СтрокиПлатежа</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <comment>(Общ)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Documents/ПриходныйКассовыйОрдер/ПриходныйКассовыйОрдер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходныйКассовыйОрдер</name>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <registerRecords>AccumulationRegister.ВзаиморасчетыПоДокументамРасчетов</registerRecords>
  <registerRecords>AccumulationRegister.Затраты</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИБ</name>
    <type>
      <types>CatalogRef.ИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Касса</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Затраты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентЦБ</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СпецНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кассир</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ПринятоОт</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Приложение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КапитальныеЗатраты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРасходов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>СубЗатрата</name>
    <type>
      <types>CatalogRef.СубЗатраты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийПКО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопПроводки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РасшифровкиЗатрат</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДДС</name>
      <type>
        <types>CatalogRef.СтатьиЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КапитальныеЗатраты</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодРасходов</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>СубЗатрата</name>
      <type>
        <types>CatalogRef.СубЗатраты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Catalogs/РегиональныеПредставители/РегиональныеПредставители.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РегиональныеПредставители</name>
  <attributes>
    <name>Емайл1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Емайл2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Активен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Регионы</name>
    <attributes>
      <name>ГруппаКонтрагентов</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>ГруппыНоменклатур</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/DataProcessors/ОтчетыДляРегиональныхПредставителей/ObjectModule.bsl
Перем МенеджерыЦБ;

Функция ПолучитьМенеджераЦБ(КонтрагентЦБ)
	СтрМенеджераЦБ=МенеджерыЦБ.Найти(КонтрагентЦБ,"КонтрагентЦБ");
				
	Если СтрМенеджераЦБ<>Неопределено Тогда
		Возврат СтрМенеджераЦБ.Менеджер;				
	КонецЕсли;
	
	Возврат Справочники.ФизическиеЛица.ПустаяСсылка();
КонецФункции // ПолучитьМенеджераЦБ()

Процедура Сформировать(ТаблицаПараметров=НЕОПРЕДЕЛЕНО) Экспорт
	// Формируем список представителей для которых формируем отчеты
	//Катаев+ 19/02/14 Определяем какие отчеты необходимо отправлять
	Если ТаблицаПараметров=НЕОПРЕДЕЛЕНО Тогда
		ВыполнятьПродажи = Истина;
		ВыполнятьОжидаемыеОплаты = Истина;
	Иначе
		ВыполнятьПродажи = Ложь;
		ВыполнятьОжидаемыеОплаты = Ложь;
	КонецЕсли;
	Для Каждого СтрокаТП ИЗ ТаблицаПараметров Цикл
		Если СтрокаТП.Имя="Отчет" Тогда
			Если Не ВыполнятьПродажи И Найти(СтрокаТП.Значение, "Продажи") > 0 Тогда
				ВыполнятьПродажи = Истина;
			КонецЕсли;
			Если Не ВыполнятьОжидаемыеОплаты И Найти(СтрокаТП.Значение, "ОжидаемыеОплаты") > 0 Тогда
				ВыполнятьОжидаемыеОплаты = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	//Катаев- 19/02/14
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РегиональныеПредставители.Наименование,
	|	РегиональныеПредставители.Емайл1,
	|	РегиональныеПредставители.Емайл2,
	|	РегиональныеПредставители.Ссылка
	|ИЗ
	|	Справочник.РегиональныеПредставители КАК РегиональныеПредставители
	|ГДЕ
	|	РегиональныеПредставители.Активен";
	ЗапросП = Новый Запрос;
	ЗапросП.Текст =
	"ВЫБРАТЬ
	|	РегиональныеПредставителиРегионы.ГруппаКонтрагентов
	|ИЗ
	|	Справочник.РегиональныеПредставители.Регионы КАК РегиональныеПредставителиРегионы
	|ГДЕ
	|	РегиональныеПредставителиРегионы.Ссылка = &Ссылка";
	ЗапросН = Новый Запрос;
	ЗапросН.Текст =
	"ВЫБРАТЬ
	|	РегиональныеПредставителиНоменклатура.ГруппыНоменклатур
	|ИЗ
	|	Справочник.РегиональныеПредставители.Номенклатура КАК РегиональныеПредставителиНоменклатура
	|ГДЕ
	|	РегиональныеПредставителиНоменклатура.Ссылка = &Ссылка";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		//Получаем регионы для которых необходимо формировать отчет
		ЗапросП.УстановитьПараметр("Ссылка", Выборка.Ссылка);
		ВыборкаП = ЗапросП.Выполнить().Выбрать();
		сзРегионов = Новый СписокЗначений;
		сзРегионыИнт = Новый СписокЗначений;
		Пока ВыборкаП.Следующий() Цикл
			Если ВыборкаП.ГруппаКонтрагентов.Владелец = Справочники.ИБ.НайтиПоКоду("SSP") Тогда
				сзРегионов.Добавить(ВыборкаП.ГруппаКонтрагентов);
				контр = Справочники.Контрагенты.НайтиПоНаименованию(ВыборкаП.ГруппаКонтрагентов,,,Справочники.ИБ.НайтиПоКоду("SMN"));
				Если контр <> Неопределено Тогда
					сзРегионыИнт.Добавить(контр);
				КонецЕсли;
			ИначеЕсли ВыборкаП.ГруппаКонтрагентов.Владелец = Справочники.ИБ.НайтиПоКоду("SMN") Тогда
				сзРегионыИнт.Добавить(ВыборкаП.ГруппаКонтрагентов);
				контр = Справочники.Контрагенты.НайтиПоНаименованию(ВыборкаП.ГруппаКонтрагентов,,,Справочники.ИБ.НайтиПоКоду("SSP"));
				Если контр <> Неопределено Тогда
					сзРегионов.Добавить(контр);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		ЗапросН.УстановитьПараметр("Ссылка", Выборка.Ссылка);
		ВыборкаН = ЗапросН.Выполнить().Выбрать();
		сзНоменклатуры = Новый СписокЗначений;
		Пока ВыборкаН.Следующий() Цикл
			сзНоменклатуры.Добавить(ВыборкаН.ГруппыНоменклатур);
		КонецЦикла;
		Если ВыполнятьПродажи Тогда
			СформироватьОтчет("Продажи",Выборка, сзРегионов, сзНоменклатуры);
		КонецЕсли;
		Если ВыполнятьОжидаемыеОплаты Тогда
			СформироватьОтчет("ОжидаемыеОплаты",Выборка, сзРегионыИнт, сзНоменклатуры);
		КонецЕсли;
	КонецЦикла;
	ОтправитьОтчеты();
КонецПроцедуры

Процедура ОтправитьОтчеты()
	Дата1 = НачалоМесяца(НачалоДня(ТекущаяДата())-1);
	Дата2 = НачалоДня(ТекущаяДата())-1;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РегиональныеПредставители.Наименование КАК ФИО,
	|	РегиональныеПредставители.Емайл1,
	|	РегиональныеПредставители.Емайл2
	|ИЗ
	|	Справочник.РегиональныеПредставители КАК РегиональныеПредставители
	|ГДЕ
	|	РегиональныеПредставители.Активен
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФИО";
	Выборка = Запрос.Выполнить().Выбрать();
	// Отправляем документ по эл. почте
	Профиль= Новый ИнтернетПочтовыйПрофиль;
	// Кухарь А.Ю.  08.09.2022 начало
	//Профиль.АдресСервераPOP3   = "srvmail2.collant.ru";
	//Профиль.АдресСервераSMTP   =  "srvmail2.collant.ru";
	//Профиль.ПортPOP3           = 110; 
	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(Профиль,ПараметрыПочты);	
	// Кухарь А.Ю.  08.09.2022 конец

	Профиль.ВремяОжидания      = 60; 
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//Профиль.Пользователь="*%*%*%";
	//Профиль.Пароль="*$*$*$";
	Профиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Логин;
	Профиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	Каталог = "\\Srvmail2\FTPFolders$\exch80\snl\regional\";
	Пока Выборка.Следующий() Цикл
		Сообщение=Новый ИнтернетПочтовоеСообщение;
		Сообщение.Получатели.Добавить(Выборка.Емайл1);
		Если Не ПустаяСтрока(Выборка.Емайл2) Тогда
			Сообщение.Получатели.Добавить(Выборка.Емайл2);
		КонецЕсли;
		Сообщение.Отправитель="ecode@collant.ru";
		Сообщение.Тема="Отчеты из 1С за период с "+Формат(Дата1,"ДЛФ=ДД")+" по "+Формат(Дата2,"ДЛФ=ДД");
		МаскаФайла = "*"+Строка(Выборка.ФИО)+".mxl";
		НайденныеФайлы = НайтиФайлы(Каталог, МаскаФайла);
		Для кол=0 По НайденныеФайлы.Количество() -1 Цикл
			ПутьФайла = НайденныеФайлы[кол].ПолноеИмя;
			Сообщение.Вложения.Добавить(ПутьФайла);
		КонецЦикла;
		Почта= Новый ИнтернетПочта;
		попытка
			Почта.Подключиться(Профиль);
		исключение
		конецПопытки;
		
		Попытка
			Почта.Послать(Сообщение);
		исключение
		конецПопытки;
		Почта.Отключиться();
		//Катаев+ 19/02/14 Удаляем отправленные файлы
		УдалитьФайлы(Каталог, МаскаФайла);
		//Катаев- 19/02/14
	КонецЦикла;
КонецПроцедуры

Процедура СформироватьОтчет(Отчет, Выборка, сзРегионов, сзНоменклатуры) Экспорт
	// Построитель
	Если Отчет = "Продажи" Тогда
		Продажи(сзРегионов, сзНоменклатуры, Выборка);
	ИначеЕсли отчет = "ОжидаемыеОплаты" Тогда
		ОжидаемыеОплаты(сзРегионов, Выборка);
	Иначе
		Возврат;
	КонецЕсли;
КонецПроцедуры

Процедура Продажи(сзРегионов, сзНоменклатуры, Выборка)
	НачалоВыполнения=ТекущаяДата();
	ЗаписатьВЛог("Отчеты для рег. представителей","Начало автоматического формирования отчета Продажи для "+Выборка.Наименование,"Информация");
	
	Дата1 = НачалоМесяца(НачалоДня(ТекущаяДата())-1);
	Дата2 = КонецДня(НачалоДня(ТекущаяДата())-1);
	ПостроительОтчета.Текст=
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(Остатки.Оборот) КАК Оборот,
	|	СУММА(ВЫБОР
	|			КОГДА Остатки.ВидДвижения = &Расход
	|					И Остатки.КодОперации <> ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.ПогашениеСертификата)
	|				ТОГДА Остатки.Количество
	|			ИНАЧЕ 0
	|		КОНЕЦ) - СУММА(ВЫБОР
	|			КОГДА Остатки.ВидДвижения = &Приход
	|					И Остатки.КодОперации <> ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.ПогашениеСертификата)
	|				ТОГДА Остатки.Количество
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ПродажиБезВозврата
	|{ВЫБРАТЬ
	|	Остатки.Номенклатура.*,
	|	Остатки.Отправитель.* КАК Покупатель,
	|	(НАЧАЛОПЕРИОДА(Остатки.Период, ДЕНЬ)) КАК ПериодДень}
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ КАК Остатки
	|ГДЕ
	|	Остатки.Период МЕЖДУ &Дата1 И &Дата2
	|	И Остатки.КодОперации В(&КодыОперацийПродажи)
	|{ГДЕ
	|	Остатки.Номенклатура.*,
	|	Остатки.Отправитель.* КАК Покупатель}
	|ИТОГИ
	|	СУММА(Оборот),
	|	СУММА(ПродажиБезВозврата)
	|ПО
	|	ОБЩИЕ
	|{ИТОГИ ПО
	|	Остатки.Номенклатура.*,
	|	Остатки.Отправитель.* КАК Покупатель,
	|	(НАЧАЛОПЕРИОДА(Остатки.Период, ДЕНЬ)) КАК ПериодДень}
	|АВТОУПОРЯДОЧИВАНИЕ";
							
		
	КодыОперацийПродажи=Новый Массив;
	КодыОперацийПродажи.Добавить(Перечисления.КодыОперацийОстатки.Реализация);
	КодыОперацийПродажи.Добавить(Перечисления.КодыОперацийОстатки.ВозвратОтПокупателя);	
	КодыОперацийПродажи.Добавить(Перечисления.КодыОперацийОстатки.ВозвратПоставщику);	
	КодыОперацийПродажи.Добавить(Перечисления.КодыОперацийОстатки.ПогашениеСертификата);	
	
	ПостроительОтчета.Параметры.Вставить("КодыОперацийПродажи",КодыОперацийПродажи);
	ПостроительОтчета.Параметры.Вставить("Приход",ВидДвиженияНакопления.Приход);
	ПостроительОтчета.Параметры.Вставить("Расход",ВидДвиженияНакопления.Расход);
		
	ПостроительОтчета.ЗаполнитьНастройки();
	ПостроительОтчета.ВыводитьДетальныеЗаписи=Ложь;
	
	ПостроительОтчета.ДоступныеПоля["ПродажиБезВозврата"].Представление	="Кол. прод. - возвр.";	
		
	ПостроительОтчета.ДоступныеПоля["ПериодДень"].Представление	="Период день";	
	
	// Устанавливаем необходимые параметры
	// Поля
	ПостроительОтчета.ВыбранныеПоля.Очистить();
	ПостроительОтчета.ВыбранныеПоля.Добавить("ПродажиБезВозврата");
	ПостроительОтчета.ВыбранныеПоля.Добавить("Оборот");
	// Колонки
	ПостроительОтчета.ИзмеренияКолонки.Добавить("ПериодДень");
	// Строки
	ПостроительОтчета.ИзмеренияСтроки.Добавить("Покупатель",,ТипИзмеренияПостроителяОтчета.Иерархия);
	ПостроительОтчета.ИзмеренияСтроки.Добавить("Номенклатура",,ТипИзмеренияПостроителяОтчета.Иерархия);
	// Отбор
	ОтборКоличество=ПостроительОтчета.Отбор.Количество();
	Для Н = 1 По ОтборКоличество Цикл
		ПостроительОтчета.Отбор.Удалить(ОтборКоличество - Н);
	КонецЦикла;
	
	Покупатель = ПостроительОтчета.Отбор.Добавить("Покупатель");
	Покупатель.ВидСравнения = ВидСравнения.ВСпискеПоИерархии;
	Покупатель.Значение = сзРегионов;
	Покупатель.Использование = Истина;
	Номенклатура = ПостроительОтчета.Отбор.Добавить("Номенклатура");
	Номенклатура.ВидСравнения = ВидСравнения.ВСпискеПоИерархии;
	Номенклатура.Значение = сзНоменклатуры;
	Номенклатура.Использование = Истина;
	ПостроительОтчета.Параметры.Вставить("Дата1",Дата1);
	ПостроительОтчета.Параметры.Вставить("Дата2",Дата2);	
	ПостроительОтчета.РазмещениеИзмеренийВСтроках			=ТипРазмещенияИзмерений.Вместе;
	ПостроительОтчета.РазмещениеРеквизитовИзмеренийВСтроках	=ТипРазмещенияРеквизитовИзмерений.Вместе;
	
	ПостроительОтчета.РазмещениеИзмеренийВКолонках			=ТипРазмещенияИзмерений.Вместе;
	ПостроительОтчета.РазмещениеИзмеренийВКолонках			=ТипРазмещенияИзмерений.ОтдельноИТолькоВИтогах;	
			
	ПостроительОтчета.Выполнить();
	ПостроительОтчета.Макет=Неопределено;
	//ПостроительОтчета.МакетОформления=ПолучитьМакетОформления(СтандартноеОформление.Классика);
	
	ОтформатироватьПостроитель2(ПостроительОтчета,"ОтчетПродажи");	
	
	МакетЗаголовка=ПолучитьМакет("ЗаголовокПродажи");	
	
	Заг=Новый ТабличныйДокумент;
	ТекОбласть=МакетЗаголовка.ПолучитьОбласть("Заголовок");	
	ТекОбласть.Параметры.Дата1=Формат(Дата1,"ДФ=dd.MM.yy");
	ТекОбласть.Параметры.Дата2=Формат(Дата2,"ДФ=dd.MM.yy");
	
	Заг.Вывести(ТекОбласть);
	
	
	ЕстьОтбор=Ложь;
	Для Каждого СтрокаОтбора Из ПостроительОтчета.Отбор Цикл
		Если СтрокаОтбора.Использование Тогда
			ЕстьОтбор=Истина;			
		КонецЕсли;			
	КонецЦикла;	
	
	Если ЕстьОтбор Тогда		
		Заг.Вывести(МакетЗаголовка.ПолучитьОбласть("ЗаголовокОтбора"));
		Для Каждого СтрокаОтбора Из ПостроительОтчета.Отбор Цикл
			Если СтрокаОтбора.Использование Тогда
				ТекОбласть=МакетЗаголовка.ПолучитьОбласть("СтрокаОтбора");	
				ТекОбласть.Параметры.Заполнить(СтрокаОтбора);
				Заг.Вывести(ТекОбласть);			
			КонецЕсли;			
		КонецЦикла;	
	КонецЕсли;			
	
	ПостроительОтчета.МакетЗаголовкаОтчета=Заг;
	ТабДок = Новый ТабличныйДокумент;
	ПостроительОтчета.Вывести(ТабДок);
	ПутьФайла = "\\Srvmail2\FTPFolders$\exch80\snl\regional\Продажи_"+СокрЛП(Выборка.Наименование)+".mxl";
	ТабДок.Вывод=ИспользованиеВывода.Разрешить;
	ТабДок.Записать(ПутьФайла);
	ЗаписатьВЛог("Отчеты для рег. представителей","Окончание автоматического формирования отчета Продажи для "+Выборка.Наименование,"Информация",,,ТекущаяДата()-НачалоВыполнения)
	
КонецПроцедуры

Функция ОтформатироватьПостроитель2(Построитель, МакетОтчета)
	Шаблон=ПолучитьМакет(МакетОтчета);	
	
	Макет=Построитель.Макет;
	Для СчС=1 По Макет.ВысотаТаблицы Цикл	
		Для СчК=1 По Макет.ШиринаТаблицы Цикл	
			ТекОбласть=Макет.Область("R"+СчС+"C"+СчК);
			Если ТекОбласть.Заполнение=ТипЗаполненияОбластиТабличногоДокумента.Параметр Тогда
				ОбластьШаблона=Шаблон.Области.Найти(ТекОбласть.Параметр);
				Если ОбластьШаблона<>Неопределено Тогда
					ТекОбласть.Формат				=ОбластьШаблона.Формат;				
					ТекОбласть.ШиринаКолонки		=ОбластьШаблона.ШиринаКолонки;
					ТекОбласть.ВыделятьОтрицательные=ОбластьШаблона.ВыделятьОтрицательные;
					ТекОбласть.АвтоОтступ=ОбластьШаблона.АвтоОтступ;
				КонецЕсли; 
			КонецЕсли; 
		КонецЦикла;
	КонецЦикла;
	
	Построитель.Макет=Макет;
	
	Если Построитель.Макет.Области.Найти("ШапкаТаблицы")<>Неопределено Тогда
		Построитель.Макет.Области.ШапкаТаблицы.РазмещениеТекста=ТипРазмещенияТекстаТабличногоДокумента.Переносить;	
	Иначе
		Для Каждого Колонка Из ПостроительОтчета.ИзмеренияКолонки Цикл
			Для Сч=1 По 3 Цикл
				ТекИмяОбласти=""+Колонка.Имя+"Уровень"+Сч;
				ТекОбласть=Построитель.Макет.Области.Найти(ТекИмяОбласти);
				Если ТекОбласть<>Неопределено Тогда
					ТекОбласть.РазмещениеТекста=ТипРазмещенияТекстаТабличногоДокумента.Переносить;	
					// Нечаева  +++
					Если колонка.Имя="ПериодДеньСДнемНедели" Тогда
						ТекОбласть.Формат="ДФ='dd.MM.yy ддд'";
					КонецЕсли;
					
					Если колонка.Имя="ПериодДень" Тогда
						ТекОбласть.Формат="ДФ='dd.MM.yyyy'";
						//ТекОбласть.ГоризонтальноеПоложение=ГоризонтальноеПоложение.Центр;
					КонецЕсли;

					// Нечаева ---
						
				КонецЕсли;
			КонецЦикла;			
		КонецЦикла;  
	КонецЕсли;	
КонецФункции // ОтформатироватьПостроитель2()

Процедура ОжидаемыеОплаты(сзРегионов, Выборка)
	НачалоВыполнения=ТекущаяДата();
	ЗаписатьВЛог("Отчеты для рег. представителей","Начало автоматического формирования отчета Ожидаемые оплаты для "+Выборка.Наименование,"Информация");
	
	Дата1 = НачалоМесяца(НачалоДня(ТекущаяДата())-1);
	Дата2 = НачалоДня(ТекущаяДата())-1;
	НеИспользовать = Ложь;
	ВключатьПустых = Ложь;
	Запрос=Новый Запрос;
    Запрос.Текст="
	|ВЫБРАТЬ
	|	Менеджер,
	|	Ведущий КАК КонтрагентЦБ
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Владелец.Код = ""SSP""
	|	И Менеджер<>&ПустойМенеджер
	|	И НЕ Наименование ПОДОБНО ""\__%"" СПЕЦСИМВОЛ ""\""";

	
	
	Запрос.УстановитьПараметр("ПустойМенеджер",Справочники.ФизическиеЛица.ПустаяСсылка());
	
	МенеджерыЦБ=Запрос.Выполнить().Выгрузить();
	
	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	1 КАК ЕстьОбороты,
	|	ВзаиморасчетыОстаткиИОбороты.Контрагент КАК Контрагент,
	|	ВзаиморасчетыОстаткиИОбороты.Контрагент.Менеджер КАК Менеджер,
	|	ВЫБОР
	|		КОГДА ВзаиморасчетыОстаткиИОбороты.СуммаВалНачальныйОстаток > 0
	|			ТОГДА ВзаиморасчетыОстаткиИОбороты.СуммаВалНачальныйОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ДолгНач,
	|	ВЫБОР
	|		КОГДА ВзаиморасчетыОстаткиИОбороты.СуммаВалНачальныйОстаток <= 0
	|			ТОГДА -ВзаиморасчетыОстаткиИОбороты.СуммаВалНачальныйОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК АвансНач,
	|	ВЫБОР
	|		КОГДА ВзаиморасчетыОстаткиИОбороты.СуммаВалКонечныйОстаток > 0
	|			ТОГДА ВзаиморасчетыОстаткиИОбороты.СуммаВалКонечныйОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ДолгКон,
	|	ВЫБОР
	|		КОГДА ВзаиморасчетыОстаткиИОбороты.СуммаВалКонечныйОстаток <= 0
	|			ТОГДА -ВзаиморасчетыОстаткиИОбороты.СуммаВалКонечныйОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК АвансКон,
	|	NULL КАК ДатаОплаты,
	|	NULL КАК ДатаСортировки,
	|	0 КАК Отгрузка,
	|	0 КАК СуммаНакладной,
	|	0 КАК Закупка,
	|	0 КАК Возврат,
	|	0 КАК Оплата,
	|	0 КАК Прочее,
	|	""Остаток"" КАК ВидДокумента,
	|	NULL КАК Документ,
	|	"""" КАК НомерДокумента
	|ИЗ
	|	РегистрНакопления.Взаиморасчеты.ОстаткиИОбороты(
	|			&Дата1,
	|			&Дата2,
	|			,
	|			,
	|			Контрагент В ИЕРАРХИИ (&Контрагенты)
	|				И (НЕ ЕСТЬNULL(Договор.ВидДоговора_Новый, 0) В (&ИсключаемыеВидыДоговоров))) КАК ВзаиморасчетыОстаткиИОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ВзаиморасчетыОстаткиИОбороты.Контрагент,
	|	ВЫБОР
	|		КОГДА ВзаиморасчетыОстаткиИОбороты.Регистратор ССЫЛКА Документ.РасходнаяНакладная
	|				ИЛИ ВзаиморасчетыОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПриходнаяНакладная
	|			ТОГДА ВЫБОР
	|					КОГДА ВзаиморасчетыОстаткиИОбороты.Регистратор.Менеджер <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|						ТОГДА ВзаиморасчетыОстаткиИОбороты.Регистратор.Менеджер
	|					КОГДА ЕСТЬNULL(ВзаиморасчетыОстаткиИОбороты.Регистратор.ПунктДоставки, &ПустойПД) <> &ПустойПД
	|						ТОГДА ВзаиморасчетыОстаткиИОбороты.Регистратор.ПунктДоставки.Менеджер
	|					ИНАЧЕ ВзаиморасчетыОстаткиИОбороты.Регистратор.Контрагент.Менеджер
	|				КОНЕЦ
	|		ИНАЧЕ ВзаиморасчетыОстаткиИОбороты.Регистратор.Контрагент.Менеджер
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА ВзаиморасчетыОстаткиИОбороты.Регистратор ССЫЛКА Документ.РасходнаяНакладная
	|			ТОГДА ВзаиморасчетыОстаткиИОбороты.Регистратор.ДатаОплаты
	|		ИНАЧЕ ВзаиморасчетыОстаткиИОбороты.Период
	|	КОНЕЦ,
	|	ВзаиморасчетыОстаткиИОбороты.Период,
	|	ВЫБОР
	|		КОГДА ВзаиморасчетыОстаткиИОбороты.Регистратор ССЫЛКА Документ.РасходнаяНакладная
	|				И ВзаиморасчетыОстаткиИОбороты.Регистратор.Дата >= &Дата1
	|			ТОГДА ВзаиморасчетыОстаткиИОбороты.СуммаВалПриход
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВзаиморасчетыОстаткиИОбороты.Регистратор ССЫЛКА Документ.РасходнаяНакладная
	|			ТОГДА ВзаиморасчетыОстаткиИОбороты.СуммаВалПриход
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВзаиморасчетыОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПриходнаяНакладная
	|				И ВзаиморасчетыОстаткиИОбороты.Регистратор.Дата >= &Дата1
	|				И ВзаиморасчетыОстаткиИОбороты.Регистратор.КодОперации <> &КодОперации_Возврат
	|			ТОГДА ВзаиморасчетыОстаткиИОбороты.СуммаВалРасход
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВзаиморасчетыОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПриходнаяНакладная
	|				И ВзаиморасчетыОстаткиИОбороты.Регистратор.Дата >= &Дата1
	|				И ВзаиморасчетыОстаткиИОбороты.Регистратор.КодОперации = &КодОперации_Возврат
	|			ТОГДА ВзаиморасчетыОстаткиИОбороты.СуммаВалРасход
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА (ВзаиморасчетыОстаткиИОбороты.Регистратор ССЫЛКА Документ.ДвиженияДенежныхСредств
	|				ИЛИ ВзаиморасчетыОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер)
	|				И ВзаиморасчетыОстаткиИОбороты.Регистратор.Дата >= &Дата1
	|			ТОГДА -ВзаиморасчетыОстаткиИОбороты.СуммаВалОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА (НЕ(ВзаиморасчетыОстаткиИОбороты.Регистратор ССЫЛКА Документ.РасходнаяНакладная
	|					ИЛИ ВзаиморасчетыОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПриходнаяНакладная
	|					ИЛИ ВзаиморасчетыОстаткиИОбороты.Регистратор ССЫЛКА Документ.ДвиженияДенежныхСредств
	|					ИЛИ ВзаиморасчетыОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер))
	|			ТОГДА -ВзаиморасчетыОстаткиИОбороты.СуммаВалОборот
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВзаиморасчетыОстаткиИОбороты.Регистратор ССЫЛКА Документ.РасходнаяНакладная
	|			ТОГДА ""РНК""
	|		КОГДА ВзаиморасчетыОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПриходнаяНакладная
	|			ТОГДА ""ПНК""
	|		КОГДА ВзаиморасчетыОстаткиИОбороты.Регистратор ССЫЛКА Документ.ДвиженияДенежныхСредств
	|			ТОГДА ""ДДС""
	|		КОГДА ВзаиморасчетыОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
	|			ТОГДА ""ПКО""
	|		ИНАЧЕ ""Прочее""
	|	КОНЕЦ,
	|	ВзаиморасчетыОстаткиИОбороты.Регистратор,
	|	ВзаиморасчетыОстаткиИОбороты.Регистратор.Номер
	|ИЗ
	|	РегистрНакопления.Взаиморасчеты.ОстаткиИОбороты(
	|			,
	|			&Дата2,
	|			Регистратор,
	|			Движения,
	|			Контрагент В ИЕРАРХИИ (&Контрагенты)
	|				И (НЕ ЕСТЬNULL(Договор.ВидДоговора_Новый, 0) В (&ИсключаемыеВидыДоговоров))) КАК ВзаиморасчетыОстаткиИОбороты
	|ГДЕ
	|	(НЕ ВзаиморасчетыОстаткиИОбороты.Регистратор ССЫЛКА Документ.ОтчетКассовойСмены)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Контрагент,
	|	ДатаОплаты УБЫВ,
	|	НомерДокумента УБЫВ
	|ИТОГИ
	|	МИНИМУМ(ЕстьОбороты),
	|	СУММА(ДолгНач),
	|	СУММА(АвансНач),
	|	СУММА(ДолгКон),
	|	СУММА(АвансКон),
	|	СУММА(Отгрузка),
	|	СУММА(СуммаНакладной),
	|	СУММА(Закупка),
	|	СУММА(Возврат),
	|	СУММА(Оплата),
	|	СУММА(Прочее)
	|ПО
	|	Контрагент";
	
	Запрос.УстановитьПараметр("Дата1",НачалоДня(Дата1));
	Запрос.УстановитьПараметр("Дата2",КонецДня(Дата2));
	
	ИсключаемыеВидыДоговоров=Новый Массив;
	ИсключаемыеВидыДоговоров.Добавить(Справочники.ВидыДоговоров.Бонус);
	ИсключаемыеВидыДоговоров.Добавить(Справочники.ВидыДоговоров.Услуги);
	ВыборкаВидов = Справочники.ВидыДоговоров.Выбрать();
	Пока ВыборкаВидов.Следующий() Цикл
		ТекущийВидДоговора = ВыборкаВидов.Ссылка;
		Если ТекущийВидДоговора.ЭтоГруппа тогда Продолжить КонецЕсли;
		Если НЕ ТекущийВидДоговора = Справочники.ВидыДоговоров.Товары_Продажа Тогда 
		ИсключаемыеВидыДоговоров.Добавить(ТекущийВидДоговора);
		Конецесли;
	КонецЦикла;		
	Запрос.УстановитьПараметр("ИсключаемыеВидыДоговоров",	ИсключаемыеВидыДоговоров);
	Запрос.УстановитьПараметр("Контрагенты",				сзРегионов);
	Запрос.УстановитьПараметр("ПустойПД",					Справочники.ПунктыДоставки.ПустаяСсылка());
	Запрос.УстановитьПараметр("КодОперации_Возврат",		Перечисления.КодыОперацийОстатки.ВозвратОтПокупателя);	
	
	ТВ=Новый ТаблицаЗначений;
	ТВ.Колонки.Добавить("Контрагент");
	ТВ.Колонки.Добавить("Менеджер",			Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ТВ.Колонки.Добавить("Документ");
	ТВ.Колонки.Добавить("НомерДокумента");
	ТВ.Колонки.Добавить("ДатаОплаты");
	ТВ.Колонки.Добавить("ДатаСортировки");
	ТВ.Колонки.Добавить("ДолгНач",				ПолучитьОписаниеТиповЧисла(19,2));
	ТВ.Колонки.Добавить("ДолгКон",				ПолучитьОписаниеТиповЧисла(19,2));
	ТВ.Колонки.Добавить("АвансНач",				ПолучитьОписаниеТиповЧисла(19,2));
	ТВ.Колонки.Добавить("АвансКон",				ПолучитьОписаниеТиповЧисла(19,2));
	ТВ.Колонки.Добавить("Отгрузка",				ПолучитьОписаниеТиповЧисла(19,2));
	ТВ.Колонки.Добавить("СуммаНакладной",		ПолучитьОписаниеТиповЧисла(19,2));
	ТВ.Колонки.Добавить("Закупка",				ПолучитьОписаниеТиповЧисла(19,2));
	ТВ.Колонки.Добавить("Возврат",				ПолучитьОписаниеТиповЧисла(19,2));
	ТВ.Колонки.Добавить("Оплата",				ПолучитьОписаниеТиповЧисла(19,2));
	ТВ.Колонки.Добавить("ОплатаПоНакладной",	ПолучитьОписаниеТиповЧисла(19,2));
	ТВ.Колонки.Добавить("Прочее",				ПолучитьОписаниеТиповЧисла(19,2));
	ТВ.Колонки.Добавить("ДолгПросроченный",		ПолучитьОписаниеТиповЧисла(19,2));
	ТВ.Колонки.Добавить("ДолгНеПросроченный",	ПолучитьОписаниеТиповЧисла(19,2));
	ТВ.Колонки.Добавить("НедельПросрочки",		ПолучитьОписаниеТиповЧисла(19,0));
	ТВ.Колонки.Добавить("ДнейПросрочки",		ПолучитьОписаниеТиповЧисла(19,0));
	ТВ.Колонки.Добавить("ЛимитКредита",			ПолучитьОписаниеТиповЧисла(19,0));

	Результат=Запрос.Выполнить();
	
	ЛимитыКредита=ПолучитьЛимитыКредита();
	
	ВыборкаПоКонтрагентам=Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Контрагент");
	Пока ВыборкаПоКонтрагентам.Следующий() Цикл
		Если НеИспользовать И ВыборкаПоКонтрагентам.Контрагент.НеИспользовать Тогда  Продолжить КонецЕсли;
		Если НЕ ВключатьПустых И ВыборкаПоКонтрагентам.ЕстьОбороты = 2 Тогда Продолжить КонецЕсли;		
		
		СтрокаТВ=ТВ.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТВ,ВыборкаПоКонтрагентам,"Контрагент,Менеджер,ДолгНач,ДолгКон,АвансНач,АвансКон");		
		СтрокаТВ.Менеджер=ПолучитьМенеджераЦБ(ВыборкаПоКонтрагентам.Контрагент);
		СтрокаТВ.Документ=Неопределено;
		
		
		ТекДолг		=ВыборкаПоКонтрагентам.ДолгКон;
		ТекОплата	=ВыборкаПоКонтрагентам.Оплата;
			
		ВыборкаПоДокументам=ВыборкаПоКонтрагентам.Выбрать();	
		
		Дата0=НачалоДня(Дата1)-1;
		
		Пока ВыборкаПоДокументам.Следующий() Цикл
			Если ВыборкаПоДокументам.ВидДокумента="Остаток" Тогда Продолжить КонецЕсли; 			
			Если ВыборкаПоДокументам.ДатаОплаты<НачалоДня(Дата1) И (ТекДолг<=0 И ТекОплата<=0) Тогда Прервать КонецЕсли;
			Если ВыборкаПоДокументам.ДатаОплаты<НачалоДня(Дата1) И ВыборкаПоДокументам.ВидДокумента<>"РНК" Тогда Продолжить КонецЕсли;			
			
			СтрокаТВ=ТВ.Добавить();
			СтрокаТВ.Контрагент		=ВыборкаПоДокументам.Контрагент;
			СтрокаТВ.Менеджер		=ВыборкаПоДокументам.Менеджер;
			СтрокаТВ.Документ		=ВыборкаПоДокументам.Документ;
			СтрокаТВ.НомерДокумента	=ВыборкаПоДокументам.НомерДокумента;
			СтрокаТВ.ДатаСортировки	=ВыборкаПоДокументам.ДатаСортировки;
			СтрокаТВ.ДатаОплаты		=ВыборкаПоДокументам.ДатаОплаты;			
				
			Если ВыборкаПоДокументам.ВидДокумента="РНК" Тогда
				СтрокаТВ.СуммаНакладной =ВыборкаПоДокументам.СуммаНакладной;
				СтрокаТВ.Отгрузка		=ВыборкаПоДокументам.Отгрузка;				
				
				Если ТекДолг=0 И ТекОплата<>0 Тогда
					СтрокаТВ.ОплатаПоНакладной=Макс(Мин(ТекОплата,ВыборкаПоДокументам.СуммаНакладной),0);									
					ТекОплата=Макс(0,ТекОплата-СтрокаТВ.ОплатаПоНакладной);
				КонецЕсли;
				
				Если ТекДолг>0 Тогда
					Если ВыборкаПоДокументам.ДатаОплаты<НачалоДня(Дата2) Тогда
						СтрокаТВ.ДолгПросроченный	=Мин(ВыборкаПоДокументам.СуммаНакладной,ТекДолг);						
						СтрокаТВ.НедельПросрочки	=(Дата2-ВыборкаПоДокументам.ДатаОплаты)/(7*24*60*60);
						СтрокаТВ.ДнейПросрочки	=(Дата2-ВыборкаПоДокументам.ДатаОплаты)/(24*60*60) ;
					Иначе
						СтрокаТВ.ДолгНеПросроченный	=Мин(ВыборкаПоДокументам.СуммаНакладной,ТекДолг);						
					КонецЕсли;					
						
					ТекДолг=Макс(ТекДолг-ВыборкаПоДокументам.СуммаНакладной,0);
					
					Дата0=Мин(Дата0,НачалоДня(ВыборкаПоДокументам.ДатаОплаты)-1);
				КонецЕсли;				
				
				Если ВыборкаПоДокументам.ДатаСортировки<НачалоДня(Дата1) И СтрокаТВ.ОплатаПоНакладной=0 И СтрокаТВ.ДолгПросроченный=0 И СтрокаТВ.ДолгНеПросроченный=0 Тогда
					ТВ.Удалить(СтрокаТВ);
					СтрокаТВ=Неопределено;
				КонецЕсли; 
			Иначе
				ЗаполнитьЗначенияСвойств(СтрокаТВ,ВыборкаПоДокументам,"Закупка,Возврат,Оплата,Прочее");
			КонецЕсли;			
			
			Если СтрокаТВ<>Неопределено И СтрокаТВ.Менеджер.Пустая() Тогда
				СтрокаТВ.Менеджер=ПолучитьМенеджераЦБ(СтрокаТВ.Контрагент);				
			КонецЕсли; 
		КонецЦикла;
		
		Если ТекДолг>0 или ТекОплата>0 Тогда
			СтрокаТВ=ТВ.Добавить();
			СтрокаТВ.Контрагент			=ВыборкаПоКонтрагентам.Контрагент;
			СтрокаТВ.Менеджер			=ПолучитьМенеджераЦБ(СтрокаТВ.Контрагент);				
			СтрокаТВ.Документ			="<--! НЕ РАСПРЕДЕЛЕНО !-->";
			СтрокаТВ.ДатаСортировки		=Дата0;
			СтрокаТВ.ДатаОплаты			=Дата0;
			
			СтрокаТВ.ДолгПросроченный	=ТекДолг;
			СтрокаТВ.ОплатаПоНакладной  =ТекОплата;
		КонецЕсли; 
	КонецЦикла;
	
	ВнешниеНаборыДанных = Новый Структура;	
	ВнешниеНаборыДанных.Вставить("Данные", ТВ);
	ТЛ= ПолучитьЛимитыКредита();
	ВнешниеНаборыДанных.Вставить("ЛимитыКредита",ТЛ);
	
	ДанныеРасшифровки	= Неопределено;
	СхемаКомпоновкиОжидаемыеОплаты = ПолучитьМакет("СхемаКомпоновкиОжидаемыеОплаты");
	КомпоновщикМакета	= Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки		= КомпоновщикМакета.Выполнить(СхемаКомпоновкиОжидаемыеОплаты,СхемаКомпоновкиОжидаемыеОплаты.НастройкиПоУмолчанию, ДанныеРасшифровки);
	
	ПроцессорКомпоновки= Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,ВнешниеНаборыДанных,ДанныеРасшифровки);
	
	ТД=Новый ТабличныйДокумент;
	ТД.Очистить();
	
	Макет=ПолучитьМакет("ЗаголовокОжидаемыеОплаты");
	Макет.Параметры.Дата1=Формат(Дата1,"ДФ=dd.MM.yyyy");
	Макет.Параметры.Дата2=Формат(Дата2,"ДФ=dd.MM.yyyy");	
	
	Макет.Параметры.Контрагент="";
	Для Каждого СтрокаТЧ Из сзРегионов Цикл
		Макет.Параметры.Контрагент=Макет.Параметры.Контрагент+СтрокаТЧ.Значение+";";	
	КонецЦикла;
	Если СтрДлина(Макет.Параметры.Контрагент) > 200 Тогда
	Макет.Параметры.Контрагент = Лев(Макет.Параметры.Контрагент,200);	
	КонецЕсли;
	
	
	ТД.Вывести(Макет);
	ВывестиРезультатВТабличныйДокумент2(ПроцессорКомпоновки, ТД);
	ПутьФайла = "\\Srvmail2\FTPFolders$\exch80\snl\regional\ОжидаемыеОплаты_"+СокрЛП(Выборка.Наименование+".mxl");
	ТД.Вывод=ИспользованиеВывода.Разрешить;
	ТД.Записать(ПутьФайла);
	ЗаписатьВЛог("Отчеты для рег. представителей","Окончание автоматического формирования Ожидаемые оплаты Продажи для "+Выборка.Наименование,"Информация",,,ТекущаяДата()-НачалоВыполнения);
КонецПроцедуры

Функция ПолучитьЛимитыКредита()
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ	
	|	СУММА(Договоры.ЛимитКредита) КАК ЛимитКредита,
	|	Договоры.КодЦБ КАК Код,
	|	Договоры.ВалютаКредита КАК Валюта
	|ПОМЕСТИТЬ Лимиты
	|ИЗ
	|	Справочник.Договоры КАК Договоры
	|ГДЕ
	|	НЕ Договоры.НеИспользовать
	|	И НЕ Договоры.ПометкаУдаления
	|СГРУППИРОВАТЬ ПО
	|	Договоры.КодЦБ,
	|	Договоры.ВалютаКредита	
	|;
	|ВЫБРАТЬ 
	|	Контрагенты.Ссылка	КАК Контрагент,
	|	ВЫБОР КОГДА Лимиты.Валюта<>&Рубли ТОГДА Курсы.Курс ИНАЧЕ 1 КОНЕЦ*Лимиты.ЛимитКредита КАК ЛимитКредита	
	|ИЗ
	|	Лимиты	
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Справочник.Контрагенты КАК 	Контрагенты
	|ПО 
	|	Лимиты.Код=	Контрагенты.Код
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.КурсыВалют.СрезПоследних() КАК Курсы
	|ПО
	|	Курсы.Валюта=Лимиты.Валюта		
	|ГДЕ 
	|	Лимиты.ЛимитКредита<>0";
	
	Запрос.УстановитьПараметр("Рубли",ПараметрыСеанса.ВалютаУпр_2009);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Процедура ВывестиРезультатВТабличныйДокумент2(ПроцессорКомпоновкиДанных, ТабличныйДокумент)

	// Создадим и инициализируем процессор вывода результата
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ТабличныйДокумент);

	// Обозначим начало вывода
	ПроцессорВывода.НачатьВывод();
	
	ТаблицаЗафиксирована = Ложь;
	
	// Основной цикл вывода отчета
	Пока Истина Цикл

		// Получим следующий элемент результата компоновки
		ЭлементРезультата = ПроцессорКомпоновкиДанных.Следующий();

		Если ЭлементРезультата = Неопределено Тогда
			// Следующий элемент не получен - заканчиваем цикл вывода
			Прервать;

		Иначе
			Если Не ТаблицаЗафиксирована И ЭлементРезультата.ЗначенияПараметров.Количество() > 0 Тогда
					ТаблицаЗафиксирована = Истина;
					ТабличныйДокумент.ФиксацияСверху = ТабличныйДокумент.ВысотаТаблицы;
			КонецЕсли;
				
			// Элемент получен - выведем его при помощи процессора вывода
			ПроцессорВывода.ВывестиЭлемент(ЭлементРезультата);

		КонецЕсли;

	КонецЦикла;

	ПроцессорВывода.ЗакончитьВывод();

КонецПроцедуры
